{
    "domain_url": "https://aipxperts.com/",
    "transcript": "We had this beautiful cloud kitchen set\nup. Talented chefs ready to prepare\nfood. Riders also set up on their bikes\nready to deliver orders. We had\neverything in place but we were not\ngetting orders at all.\nIs anyone hungry? We'll order from Swiss\nand U.\nYeah. You have Poha?\nYes. Done.\nNo, wait. Wait, wait, wait, wait. I\nWhat? What all do you have?\nWe have everything.\nAre you actually ordering?\nYep. You can show the bag. Swish is a\n10-minute food delivery platform.\nThe speed at which Swiss delivers.\nDelivery. The speed\nswish has been very fast.\nWe are a full stack solution where right\nfrom food preparation to the end\ndelivery to the customer is something\nthat we own. We prepare food inhouse in\nour delight centers as we call it. They\nare optimized cloud kitchens and we\nessentially deliver in a radius of 2 km\nto like serve best quality food in like\n10 minutes. Right after college, I was\npretty sure I wanted to be part of early\nstage consumer companies. That's where\nthe action was happening. An exciting\nopportunity came up at a company called\nPillow Fund. Uh again an axel back\ncompany. Me and my current co-founders\nboth Ojel and S and all three of us\nhappened to join at the founding stage\nof the company. We scaled up in like so\nmany countries. the company got\ndissolved which is where we realized\nthat we want to start something of our\nown.\nSo it was just like the three of us\njuggling between different cafes\nwherever the space was available. We\nwanted to like figure out a consumer\nwide space to build in and we were\nevaluating a bunch of different\nindustries what new things are coming\nup. One day we were like working out of\na cafe and we had not had lunch. It was\n4 p.m. and we were like crazy hungry. Uh\nwe at that point of time we placed like\norder for two coffees and a sandwich. We\nwere waiting like 5 minutes it didn't\ncome, 10 minutes it didn't come. It took\nlike about 30 minutes for them to like\ngive the order and that sparked uh a\nthought in our minds. Whenever you sort\nof want food, you want it immediately.\nBut the problem statement was also very\nchallenging and complex like how do you\nprepare food and deliver it in 10\nminutes when food in India is like\nliterally so complex and literally so\nwide. So we had this beautiful cloud\nkitchen set up. Talented chefs ready to\nprepare food. Riders also set up on\ntheir bikes ready to deliver orders. We\nhad everything in place but we were not\ngetting orders at all.\nNaturally it felt like let's announce\nabout this to public. Maybe we'll get\nlike 50 to 100 reactions uh on socials\nand maybe one or two people will order\nout of that. Once we did that it got\npicked up. We ended up having so many\norders that the chefs and the riders\nlike felt uh limited and we had to call\nour friends and friends moms and all to\ncome and help and everybody's response\nwas I don't need food in 10 minutes and\nwe've seen the same people ordering\nagain and again from us\nwho's going to sit though\nthe bag\n[Applause]\nthe product is the king\nit's been lazy. Um it is definitely\nhaven't gotten a chance to breathe.\nUh figuring out the process of uh\npreparing food freshly in like 4 5 6\nminutes was something that uh was like\nreally complex and uh luckily we were\nable to figure out with like a team of\nreally super smart people.\n[Music]\nHow much time did it take? 7 minutes.\n7 minutes. Oh, damn.\nOkay,\nwe can uh distribute it.\nYeah. Sorry to give it to you. I don't\nknow what to do with this."
}