"**Output 1:** Generative AI, AI agents, agentic AI, Large Language Models (LLM), AI applications\n\n**Output 2: Justification Primary:**\n\n* **Generative AI:**  \n    * **Relevance:** The video's core theme is comparing and contrasting generative AI with AI agents and agentic AI.  Generative AI is directly defined and explained as a foundational concept.\n    * **Search Intent:** Users searching for \"Generative AI\" are likely seeking a fundamental understanding of the technology, its capabilities, and how it differs from other AI approaches. This keyword directly addresses that need.\n    * **Contextual Importance:** The term \"Generative AI\" is repeatedly used throughout the video as the starting point of the comparison. The speaker explains its function of generating new content (images, text, audio, video).\n    * **Competitiveness:**  \"Generative AI\" is a highly competitive keyword, but the video's specific focus on differentiating it from AI agents and agentic AI allows it to stand out in search results by targeting a more niche audience interested in the distinctions between these AI types.\n    * **Industry-Specific Terms:** This is a widely used and accepted term within the AI field; no specific industry jargon beyond standard AI terminology is needed.\n\n* **AI agents:**\n    * **Relevance:** The video explicitly compares and contrasts AI agents with generative AI and agentic AI.  A significant portion of the video is devoted to explaining the function and application of AI agents.\n    * **Search Intent:** Users searching for \"AI agents\" are looking for information on how AI agents work, their capabilities, and how they differ from other AI systems. The video provides this information directly.\n    * **Contextual Importance:** \"AI agents\" are presented as a key component of the discussion; the explanation of tool calls and their role in AI agents is central to the video's message.\n    * **Competitiveness:** \"AI agents\" is a competitive keyword but the video's detailed explanation of its specific function, especially relating it to LLM's and agentic AI, helps improve its ranking potential by focusing on a refined aspect of the broader topic.\n    * **Industry-Specific Terms:** This is a standard term used in the AI field.\n\n* **Agentic AI:**\n    * **Relevance:** The video focuses significantly on distinguishing agentic AI from AI agents and generative AI, explaining its collaborative nature and capacity for complex task solving.\n    * **Search Intent:** Users searching for \"Agentic AI\" are likely looking for advanced information on AI systems capable of managing complex workflows and collaborating with multiple agents to complete tasks. The video directly addresses this.\n    * **Contextual Importance:** The video explicitly contrasts agentic AI with AI agents, highlighting the crucial difference of multiple agents collaborating within a system. This concept is explained thoroughly.\n    * **Competitiveness:** \"Agentic AI\" is a less competitive keyword because it's a more specialized term. The video's detailed explanation establishes the content as a valuable resource for those seeking to understand this emerging concept.\n    * **Industry-Specific Terms:** This is a relatively specific term in AI, making it potentially more effective for targeting a knowledgeable audience.\n\n* **Large Language Models (LLM):**\n    * **Relevance:** LLMs are presented as a core component of both generative AI and AI agents, forming the underlying technology driving these systems. The video highlights their strengths and limitations.\n    * **Search Intent:** Users searching for \"Large Language Models (LLM)\" are looking for an explanation of how they work, their capabilities, and limitations, all of which the video provides in the context of its broader theme.\n    * **Contextual Importance:** LLMs are discussed repeatedly as the engine behind the AI systems being compared.  The discussion of their limitations (lack of real-time information access) is crucial to understanding the need for tool calls in AI agents.\n    * **Competitiveness:** \"Large Language Models\" is a very competitive keyword; however, the focus of the video on how LLMs are used within AI agents and Agentic AI systems allows for targeted reach and a competitive advantage.\n    * **Industry-Specific Terms:** This is standard terminology in the AI field.\n\n* **AI applications:**\n    * **Relevance:** The video discusses practical applications of Generative AI, AI agents, and Agentic AI systems, showcasing their potential impact on various tasks.\n    * **Search Intent:** Users searching for \"AI applications\" are looking for real-world examples and use cases of these technologies. The video provides examples like chatbots and converting YouTube videos into blog posts.\n    * **Contextual Importance:** The video uses examples to illustrate the capabilities and potential use cases of different AI approaches, highlighting their practical implications.\n    * **Competitiveness:** \"AI applications\" is a very broad keyword; however, by focusing on specific types of AI and their applications, the video targets a more refined audience, enhancing the effectiveness of the term.\n    * **Industry-Specific Terms:** No specific jargon is required beyond the standard AI terminology.\n\n\n**Output 3:**  LLM models,  AI chatbot,  LangChain,  tool call,  Agentic AI workflow\n\n\n**Output 4: Justification Secondary:**\n\n* **LLM models:**\n    * **Complementarity:** This complements the primary keywords by specifying the type of model often used within AI agents and generative AI systems, adding technical depth.\n    * **Search Broadening:** It captures users searching for information specifically on LLM applications within broader AI contexts.\n    * **User Value:** Provides more technical detail for those with a stronger understanding of AI fundamentals.\n    * **Strategic Importance:** Adds specificity, enabling the video to appear in searches for more technical discussions on the topic.\n\n* **AI chatbot:**\n    * **Complementarity:**  Provides a concrete example of a generative AI application, illustrating the practical use of generative AI.\n    * **Search Broadening:** Captures users specifically interested in chatbot development and its relationship to generative AI.\n    * **User Value:**  Gives a practical example relevant to many viewers.\n    * **Strategic Importance:** Provides context and illustrates a key application of the technologies discussed.\n\n* **LangChain:**\n    * **Complementarity:** Names a specific library used in the development of AI agents and agentic AI systems, adding practical value for developers.\n    * **Search Broadening:** Captures searches related to specific tools and technologies relevant to the video's content.\n    * **User Value:** Offers concrete tools and resources for those who want to learn more and implement the discussed concepts.\n    * **Strategic Importance:** Provides practical guidance and resources to those interested in implementing AI agent systems.\n\n* **tool call:**\n    * **Complementarity:**  Explains a key mechanism by which AI agents interact with external data sources, clarifying the operation of AI agents.\n    * **Search Broadening:** Catches users searching for specific technical aspects of AI agent functioning.\n    * **User Value:** Offers deeper technical explanation of a key component of AI agents.\n    * **Strategic Importance:** Details a core mechanism of AI agents, providing valuable technical information.\n\n* **Agentic AI workflow:**\n    * **Complementarity:**  Provides a high-level overview of how multiple AI agents collaborate to achieve a complex task, contextualizing agentic AI.\n    * **Search Broadening:** Catches users searching for information on the practical implementation and architecture of agentic AI systems.\n    * **User Value:** Explains the organization and functioning of agentic AI, which is often a complex and nuanced topic.\n    * **Strategic Importance:**  Illustrates the overall process of agentic AI, which is a complex and important topic."