{
    "video_topic": "Swish 10-Minute Food Delivery Platform",
    "primary_keywords": [
        "Swish food delivery",
        "10-minute food delivery",
        "Swish cloud kitchen",
        "fast food delivery India",
        "on-demand food delivery"
    ],
    "primary_justification": {
        "Swish food delivery": "This keyword directly reflects the core offering of the company featured in the video and is the most obvious search term someone interested in their service would use. It's highly relevant and focuses on the brand and its main function.",
        "10-minute food delivery": "This is the unique selling proposition (USP) of Swish. Users interested in the video's topic are likely searching for this specific fast delivery timeframe. This highlights the speed and efficiency of the service.",
        "Swish cloud kitchen": "This keyword incorporates the brand name with their operational model. This is relevant to understanding how Swish achieves their fast delivery times by optimizing their kitchen operations.",
        "fast food delivery India": "This keyword targets a broader audience interested in quick food delivery within India, aligning with the video's context and geographic focus. It captures potential customers searching for rapid delivery options in the Indian market.",
        "on-demand food delivery": "This keyword broadens the scope to capture users searching for food delivery services that are available immediately when they want it. It highlights the real-time availability aspect of Swish."
    },
    "secondary_keywords": [
        "food delivery startup",
        "food preparation in-house",
        "optimized cloud kitchens",
        "food delivery within 2km radius",
        "Pillow Fund startup"
    ],
    "secondary_justification": {
        "food delivery startup": "This keyword appeals to those interested in new companies in the food delivery sector, providing a broader category for discovery.",
        "food preparation in-house": "This complements the primary keywords by highlighting a specific aspect of Swish's business model (controlling food quality and preparation speed).",
        "optimized cloud kitchens": "This keyword emphasizes the technological and operational advantages of Swish, appealing to users interested in the efficiency of the service. It highlights how the cloud kitchen model enables fast delivery.",
        "food delivery within 2km radius": "This keyword specifies the geographical scope of Swish's delivery service, providing valuable information for potential customers. It helps users understand the range of the service.",
        "Pillow Fund startup": "This keyword connects Swish to the founders' previous venture, Pillow Fund, potentially attracting users familiar with that company or interested in the founders' background."
    }
}