{
    "video_topic": "Nothing Phone 3 Review: They Lied!",
    "primary_keywords": [
        "Nothing Phone 3",
        "Nothing Phone 3 review",
        "Nothing Phone 3 flagship",
        "Snapdragon 8s Gen 4",
        "Nothing Phone 3 battery life"
    ],
    "primary_justification": {
        "Nothing Phone 3": "This is the primary subject of the video, directly relating to the phone being reviewed. Users searching for information about this specific phone will use this term.",
        "Nothing Phone 3 review": "This is a common search query for people seeking evaluations and opinions on the phone, making it a highly relevant and targeted keyword.",
        "Nothing Phone 3 flagship": "The video discusses whether the phone is a true flagship, so this keyword captures users interested in its classification and capabilities.",
        "Snapdragon 8s Gen 4": "The video highlights the phone's processor, which is a key component affecting performance. Users researching the phone's specs will likely search for this.",
        "Nothing Phone 3 battery life": "The video emphasizes the exceptional battery performance, making this a crucial keyword for users concerned about battery longevity."
    },
    "secondary_keywords": [
        "Nothing Phone 3 camera",
        "Nothing Phone 3 display",
        "mid-range vs flagship phones",
        "best smartphone 2024",
        "Nothing Phone 3 price"
    ],
    "secondary_justification": {
        "Nothing Phone 3 camera": "The video briefly mentions the camera setup, so this keyword can attract users specifically interested in the phone's photography capabilities.",
        "Nothing Phone 3 display": "The video describes the phone's display quality and features, making this a relevant keyword for users prioritizing screen performance.",
        "mid-range vs flagship phones": "The core argument of the video revolves around comparing the Nothing Phone 3 to flagship devices, so this keyword broadens the search appeal.",
        "best smartphone 2024": "This keyword targets users looking for recommendations and rankings of the best phones available, potentially capturing a broader audience.",
        "Nothing Phone 3 price": "Since price is a major factor in the review's discussion of whether it's a true flagship, this keyword is relevant for users evaluating its value."
    }
}