{
    "video_topic": "Nothing Phone 3 Review",
    "primary_keywords": [
        "Nothing Phone 3",
        "Nothing Phone 3 review",
        "Nothing Phone 3 flagship",
        "Nothing Phone 3 camera",
        "Nothing Phone 3 battery"
    ],
    "primary_justification": {
        "Nothing Phone 3": "This is the central subject of the review, appearing prominently in the title and throughout the video. It is the core search term for anyone interested in this specific phone.",
        "Nothing Phone 3 review": "Directly reflects the video's purpose as a review. Users searching for reviews of this phone will find this keyword highly relevant.",
        "Nothing Phone 3 flagship": "Addresses the central argument of the video: whether the Nothing Phone 3 truly qualifies as a flagship device. Captures searches related to the phone's positioning in the market.",
        "Nothing Phone 3 camera": "Highlights a specific feature (the camera) which is discussed in detail, appealing to users interested in the phone's photographic capabilities.",
        "Nothing Phone 3 battery": "Highlights a specific feature (the battery) which is discussed in detail, appealing to users interested in the phone's battery life."
    },
    "secondary_keywords": [
        "Nothing Phone 3 price",
        "Snapdragon 8s Gen 4",
        "Nothing OS",
        "Nothing Phone 3 display",
        "best mid-range phone"
    ],
    "secondary_justification": {
        "Nothing Phone 3 price": "While the video doesn't dwell excessively on price, it's a crucial consideration for potential buyers and a common search query.",
        "Snapdragon 8s Gen 4": "The specific chipset used is a significant detail discussed in the review, relevant to tech-savvy users researching the phone's performance.",
        "Nothing OS": "The software experience is mentioned and is a differentiating factor for Nothing phones. Relevant to users interested in the unique software features.",
        "Nothing Phone 3 display": "The display is described as high quality so is a key feature, this keyword captures users seeking information about the phone's screen performance.",
        "best mid-range phone": "The review argues the phone is more mid-range than flagship, this keyword captures user searches that may not think of this as a flagship phone but could consider it as a high performing mid-range phone."
    }
}