{
    "video_topic": "Swish: A 10-Minute Food Delivery Platform Startup Story",
    "primary_keywords": [
        "10-minute food delivery",
        "Swish food delivery",
        "cloud kitchen startup",
        "fast food delivery India",
        "on-demand food delivery"
    ],
    "primary_justification": {
        "10-minute food delivery": "This phrase directly captures the core unique selling proposition (USP) of Swish, which is their speed of delivery. It aligns with a specific search intent of users looking for quick food options. It's used prominently throughout the video. While competitive, it clearly defines their niche.",
        "Swish food delivery": "This keyword directly includes the brand name, making it relevant for users specifically seeking information about Swish. It's aligned with users searching for the brand by name. The brand name 'Swish' is mentioned throughout the video making it essential. It helps in building brand awareness.",
        "cloud kitchen startup": "This captures the business model of Swish, which relies on cloud kitchens for rapid food preparation. It aligns with users interested in the operational aspects of the company. The video discusses setting up their cloud kitchens. While it might be a relatively niche search, it accurately represents the company's infrastructure.",
        "fast food delivery India": "This broadens the scope slightly to include the geographic market (India) while maintaining the emphasis on speed. It aligns with users seeking faster food delivery options within India. India is mentioned because it's where their market is, giving the phrase context. While competitive, it's essential to target the correct geographical region.",
        "on-demand food delivery": "This captures the immediacy and convenience offered by Swish's service. It aligns with users looking for instant food options. The video describes their focus to deliver food immediately after ordering. While 'on-demand' may be somewhat competitive, it describes the nature of the service."
    },
    "secondary_keywords": [
        "food delivery startup story",
        "Swish founders story",
        "Indian food tech",
        "Pillow Fund founders",
        "food preparation and delivery"
    ],
    "secondary_justification": {
        "food delivery startup story": "This keyword complements the primary keywords by focusing on the narrative aspect of the video, attracting viewers interested in the background and challenges faced by the startup. It broadens the search to potential viewers interested in entrepreneurship stories.",
        "Swish founders story": "This targets users interested in the people behind the brand, adding a human element to the content. It could capture viewers interested in the entrepreneurial journey of the founders. It offers additional value by highlighting the personal story of the founders, building a stronger connection with the audience.",
        "Indian food tech": "This keyword provides geographical context to the company which is vital as they're operating in the Indian market, while also alluding to the technological aspect of the same. Indian is added to highlight the target market.",
        "Pillow Fund founders": "The founders of Swish came from another company called Pillow Fund which is mentioned in the transcript. This phrase targets people who may be familiar with Pillow Fund and want to learn what the founders are up to now.",
        "food preparation and delivery": "While broader than the 10-minute delivery focus, this keyword adds a broader aspect of describing how they prepare food so fast and then deliver the orders to the client."
    }
}