"**Output 1: Primary Keywords:**\n\nGenerative AI, AI agents, Agentic AI, Large Language Models (LLM), AI applications\n\n**Output 2: Justification Primary:**\n\n* **Generative AI:** This is the overarching theme of the video, encompassing the core concept of AI generating new content.  The video frequently mentions generative AI and its applications.\n    * **Relevance:** The video directly explains what generative AI is, its capabilities (text, image, video generation), and how it works.\n    * **Search Intent:** Users searching for \"Generative AI\" are likely seeking a foundational understanding of the topic, which this video provides.\n    * **Contextual Importance:** The term \"Generative AI\" is used repeatedly throughout the video as the main subject.\n    * **Competitiveness:** The keyword is highly competitive, but the video's comprehensive explanation and clear examples offer value to viewers, increasing visibility.\n    * **Industry-Specific Terms:**  The term itself is an industry-standard term.\n\n* **AI agents:**  This is a key concept introduced and explained in detail, contrasting with generative AI and agentic AI.\n    * **Relevance:** The video dedicates a significant portion to explaining AI agents, their function (performing specific tasks), and their role within a larger system.\n    * **Search Intent:** Users searching for \"AI agents\" are looking for information on this specific type of AI, likely seeking to understand their capabilities and limitations.\n    * **Contextual Importance:** The video thoroughly explains AI agents using the example of using external APIs (like Tabby) to access information and solve specific problems that an LLM alone cannot address.\n    * **Competitiveness:**  The keyword is moderately competitive, allowing for potential ranking opportunities with high-quality content.\n    * **Industry-Specific Terms:**  This is a standard term within the AI field.\n\n\n* **Agentic AI:** The video contrasts this with AI agents, highlighting the collaborative nature of agentic AI systems.\n    * **Relevance:** The video distinguishes agentic AI from AI agents, focusing on the collaboration of multiple agents to achieve complex tasks.\n    * **Search Intent:** Users searching for \"Agentic AI\" are seeking a more advanced understanding of AI systems, likely focused on automation and workflow optimization.\n    * **Contextual Importance:** The video uses a detailed example (converting a YouTube video to a blog post) to illustrate how multiple AI agents work together in an agentic system, contrasting with single-task AI agents.\n    * **Competitiveness:**  This keyword is less competitive than \"Generative AI,\" offering a better chance for ranking given its specificity.\n    * **Industry-Specific Terms:** While still emerging, it's a growing term in the field.\n\n\n* **Large Language Models (LLM):**  The video frequently references LLMs as the underlying technology for both generative AI and AI agents.\n    * **Relevance:**  LLMs are central to the functionality of both generative AI and AI agents, explained thoroughly in the video.\n    * **Search Intent:** Users searching for \"Large Language Models\" are likely seeking information about this specific type of AI model and its applications.\n    * **Contextual Importance:** LLMs are repeatedly mentioned as the core technology underpinning the discussed concepts.\n    * **Competitiveness:** High competitiveness, but the video provides a unique perspective by relating LLMs to the broader context of AI agents and agentic AI.\n    * **Industry-Specific Terms:** This is a common term in the field of AI.\n\n\n* **AI applications:**  This is a broad but relevant keyword, encompassing the practical uses of the discussed AI concepts.\n    * **Relevance:** The video illustrates several applications, such as chatbots and automated workflow systems.\n    * **Search Intent:** Users are likely looking for real-world examples and use cases for generative AI, AI agents, and agentic AI.\n    * **Contextual Importance:** The video provides specific examples of AI applications that are built using the concepts explained.\n    * **Competitiveness:** Highly competitive, but the video's specific examples and explanations offer value.\n    * **Industry-Specific Terms:** This is a general term, but relevant to the video's theme.\n\n\n\n**Output 3: Secondary Keywords:**\n\nLangChain, LangGraph, Llama Index, Generative AI applications,  AI workflow automation\n\n\n**Output 4: Justification Secondary:**\n\n* **LangChain:** This is a specific library mentioned in the video, used for building AI applications.\n    * **Complementarity:** Complements the primary keywords by specifying a tool used in building generative AI and AI agent applications.\n    * **Search Broadening:** Captures users specifically looking for information on LangChain and its use in the context of generative AI and AI agents.\n    * **User Value:** Provides users with a practical tool they can use, expanding the video's utility.\n    * **Strategic Importance:** This keyword helps target users already familiar with the development side of AI.\n\n\n* **LangGraph:** Similar to LangChain, LangGraph is another library mentioned.\n    * **Complementarity:** Works similarly to LangChain, providing another development tool option.\n    * **Search Broadening:**  Attracts users searching for alternatives or comparing different libraries.\n    * **User Value:** Offers a broader selection of tools to the viewers.\n    * **Strategic Importance:** Shows the speaker's knowledge and provides multiple options to the audience.\n\n\n* **Llama Index:** Another relevant library mentioned in the video.\n    * **Complementarity:**  Similar to LangChain and LangGraph, providing additional choices for users.\n    * **Search Broadening:** Captures users specifically interested in Llama Index.\n    * **User Value:** Presents multiple tools/options for potential application development.\n    * **Strategic Importance:** Enhances the practical value of the video's information.\n\n\n* **Generative AI applications:** This keyword broadens the search terms while still focusing on the central topic.\n    * **Complementarity:**  Focuses on the practical applications of generative AI, aligning with the video's examples.\n    * **Search Broadening:**  Catches a wider audience looking for real-world use cases.\n    * **User Value:** Addresses the \"how\" aspect of generative AI, moving beyond theory.\n    * **Strategic Importance:**  Makes the information more practical and applicable for viewers.\n\n\n* **AI workflow automation:**  This keyword emphasizes a key benefit of agentic AI.\n    * **Complementarity:** Directly relates to the explanation of agentic AI and its ability to automate complex tasks.\n    * **Search Broadening:** Attracts users interested in automation, a key driver in adopting these technologies.\n    * **User Value:** Highlights a major benefit of using AI agents and agentic systems for streamlining workflows.\n    * **Strategic Importance:** Underscores a key advantage that is important to a wide range of potential users."