"**Output 1: Primary Keywords:**\ngenerative AI, AI agents, agentic AI, large language models, large image models\n\n**Output 2: Justification Primary:**\n\n* **generative AI:** This keyword is central to the video's discussion, as the speaker explicitly defines and explains generative AI, its applications (e.g., chatbots), and its reactive nature based on prompts.  The video uses this term consistently, making it highly relevant to the video's core content. Search intent for this keyword is high, as many users seek to understand the fundamental concept and capabilities of generative AI.  The keyword's contextual importance is evident throughout the entire video. While competitiveness is high for this broad term, the video's specific focus on contrasting it with AI agents and agentic AI will help it rank for niche queries.  There are no specific industry terms directly associated with generative AI, though the video touches upon specific LLMs like Llama 3 and GPT models.\n\n* **AI agents:** This is a key concept that the video directly addresses, differentiating it from generative AI and agentic AI.  The speaker explains how AI agents utilize LLMs and tools to perform specific tasks, which is the core focus of a section of the video. Search intent revolves around understanding the function and application of AI agents, a topic with growing interest. Contextual importance is high, as it forms a significant part of the video's comparative analysis. While \"AI agents\" is somewhat competitive, the video's specific discussion of its role within agentic AI systems makes it a strong choice. No specific industry terms are necessarily associated with \"AI agents\" in general but tools like Langchain and LangGraph are mentioned.\n\n* **agentic AI:** This keyword represents a crucial aspect of the video's explanation, detailing how multiple AI agents collaborate to achieve complex goals.  The video clearly distinguishes agentic AI from AI agents and generative AI. Search intent is likely to be high, as many would be looking for a clear explanation of the agentic AI concept, especially in relation to its constituent AI agents. The video spends a significant portion explaining this, therefore making its contextual importance extremely high. While competitive, the video's detailed explanation and unique comparative approach should aid search ranking.  No specific industry terms are particularly associated with \"agentic AI\" at this time.\n\n* **large language models:**  The video frequently references LLMs as the foundation for both generative AI and AI agents. The speaker uses this term consistently to explain how these models are trained and how they function within the larger context of the video’s three main topics.  Search intent is very high because many are interested in understanding the underlying mechanisms. The contextual importance is very high, as it forms the basis of the discussion. While the keyword is highly competitive, specifying its relationship to the other keywords will improve search ranking.  The video uses specific examples like Llama 3 and GPT models.\n\n* **large image models:** Although less emphasized than LLMs, the video mentions large image models alongside LLMs to show the broader capabilities of generative AI in producing various types of content. The addition of this keyword increases the relevance for users interested in both text and image generation aspects of AI.  It adds contextual depth and shows the wider picture of generative model capabilities. This term is also competitive, but this less prominent mention will be more specific to videos addressing both types of models within this discussion.\n\n\n**Output 3: Secondary Keywords:**\nLLM, prompt engineering, AI workflow automation, chatbot development, Langchain\n\n**Output 4: Justification Secondary:**\n\n* **LLM:** This is a highly relevant abbreviation for large language models, frequently used throughout the video and readily understood within the AI community. It complements the primary keywords by providing a shorter, common term for a core concept, enhancing search visibility. This broadens search traffic by encompassing users searching for this specific acronym. The term adds value as a quick reference point, making the video easier to find. Its strategic importance lies in its common usage and relevance.\n\n* **prompt engineering:** While not explicitly highlighted, the video emphasizes how prompts are crucial to guiding generative AI and AI agent behavior. Including this keyword complements the discussion of generative AI, specifically focusing on prompt interaction. It broadens the reach to those searching for advanced guidance on prompt creation, which can be a significant part of generative AI use. This keyword adds value for users seeking to improve the results they get from their generative models.  Its strategic importance is to attract users focused on this aspect of generative AI.\n\n* **AI workflow automation:** The video emphasizes how agentic AI can automate complex workflows. This secondary keyword complements the agentic AI discussion, highlighting its practical application.  It broadens search traffic by appealing to those specifically interested in workflow automation using AI. User value increases because the keyword attracts users focused on practical AI applications. Its strategic importance is to tap into this important business application.\n\n* **chatbot development:** The video uses chatbot development as a prime example of generative AI applications.  This keyword complements the generative AI section, targeting a specific and popular use case. It broadens reach to those interested in developing chatbots, specifically.  It adds value by being relatable and offers a tangible example for a user.  Its strategic importance stems from the chatbot being one of the most commonly understood applications of generative AI.\n\n* **Langchain:** The video mentions Langchain as a relevant library for building AI applications. This industry-specific term complements the discussions of AI agents and agentic AI, targeting users familiar with this library. The inclusion of this expands to those searching for resources related to Langchain.  This keyword is strategically important because it targets a specific developer audience who is interested in the technical tools mentioned in the video."